{
  "backend/analytics.mo": "Defines an Analytics module with mutable maps for tracking page visit and form submission counts, providing functions to record events and retrieve aggregated counts.",
  "backend/main.mo": "Main ICP actor that wires together blob storage and authorization mixins, defines data types (Investigation, Case, Testimonial, etc.), and exposes query/update methods for user profiles, case management, and admin operations.",
  "feature_evidence.json": "Feature evidence report documenting a single feature fix for the SupernaturalPinLogin page to perform purely client-side PIN validation without hanging on async backend calls.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-line summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell entry point that mounts the React app into a root div and sets the page title to 'Oklahoma Paranormal Investigations - Spectral Investigations'.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (Home, Resources, SubmitCase, CaseGallery, CaseDetail, MyCase, Admin pages, SupernaturalPinLogin) and wraps the app in a QueryClientProvider.",
  "frontend/src/components/admin/AnalyticsPanel.tsx": "Displays admin analytics including total page visits and form submissions as summary cards, plus a breakdown bar chart of visits per page, fetched via `useAnalyticsData`.",
  "frontend/src/components/admin/CasesManager.tsx": "Admin panel for viewing, resolving, deleting, and CSV-exporting paranormal case submissions, rendering each case as a card with metadata, photo, and action buttons.",
  "frontend/src/components/admin/InvestigationsManager.tsx": "Admin CRUD interface for managing investigation records, with a form for creating/editing investigations (title, description, date, location, status) and a list of existing entries with edit/delete actions.",
  "frontend/src/components/admin/TeamManager.tsx": "Admin CRUD interface for managing team members, providing a form to create or edit member records (name, role, bio) and a list of existing members with edit/delete controls.",
  "frontend/src/components/admin/TestimonialsManager.tsx": "Admin UI component for managing testimonials, providing forms to create, edit, and delete testimonial entries using React Query mutations.",
  "frontend/src/components/Layout.tsx": "Full-page layout component providing a sticky header with logo, desktop/mobile navigation links, theme toggle, login button, and a footer.",
  "frontend/src/components/LoginButton.tsx": "Reusable button component that handles Internet Identity login and logout, showing a loading spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and email to complete their profile setup, submitting the data via the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that restricts access based on Internet Identity authentication and user role, with a fallback check for admin sessions stored in sessionStorage/localStorage.",
  "frontend/src/contexts/AdminContext.tsx": "React context that tracks admin login state, persisting the admin session in both sessionStorage and localStorage.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token when authenticated.",
  "frontend/src/hooks/useAdmin.ts": "Thin wrapper hook that re-exports the AdminContext via useAdminContext.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides React Query hooks for CRUD operations on investigations, testimonials, and team members against the ICP backend actor.",
  "frontend/src/hooks/useAnalytics.ts": "Hook exposing callbacks to record page visits and form submissions using local analytics helpers from useAdminQueries.",
  "frontend/src/hooks/useCaseQueries.ts": "React Query hooks for fetching all cases, fetching a user's cases by email, marking cases resolved, and deleting cases via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, exposing login/logout state and identity through a React context and provider.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profile management and case submission/retrieval, all gated on actor availability and authenticated identity.",
  "frontend/src/hooks/useUserRole.ts": "Hook that fetches the caller's user role from the backend and exposes convenience booleans for admin, user, and guest roles.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind, defines light/dark CSS custom properties for a paranormal-themed color system (oklch values), and adds utility classes for glow effects, display fonts, and ethereal gradients.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and a custom InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Protected admin dashboard page with a sticky header (logout, case files link) and tabbed sections for Cases, Investigations, Testimonials, and Analytics, where only Cases is fully implemented via CasesManager.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that collects email and PIN, verifies credentials against the backend actor, and redirects to the case files page on success.",
  "frontend/src/pages/CaseDetail.tsx": "Placeholder case detail page that requires Internet Identity authentication and shows a login prompt if the user is unauthenticated.",
  "frontend/src/pages/CaseFiles.tsx": "Protected admin page wrapping the CasesManager component with a sticky header providing navigation to the dashboard and a logout button.",
  "frontend/src/pages/CaseGallery.tsx": "Placeholder case gallery page that gates access behind Internet Identity login and renders a stub content area for authenticated users.",
  "frontend/src/pages/Home.tsx": "Public landing page for Oklahoma Paranormal Investigations featuring a hero section, services grid, feature highlights, and stats, with a page-visit analytics call on mount.",
  "frontend/src/pages/MyCase.tsx": "Displays a list of paranormal cases linked to the authenticated user's email, with states for unauthenticated users, loading, missing profile, and empty/error results.",
  "frontend/src/pages/Resources.tsx": "Static educational page presenting paranormal phenomena types, investigation equipment, and safety guidelines using tabbed cards with icons and badges.",
  "frontend/src/pages/SubmitCase.tsx": "Form page that allows users to submit a paranormal case report (location, phenomena type, description, contact info, optional photo) to the backend actor.",
  "frontend/src/pages/SupernaturalPinLogin.tsx": "PIN-based admin login page that validates a hardcoded PIN, sets admin context via useAdmin, and navigates to the admin dashboard on success.",
  "frontend/src/pages/Team.tsx": "Empty file with no content or exports.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch variables), border radii, box shadows, font families, and enabling dark mode, typography, container queries, and animate plugins.",
  "project_state.json": "Tracks project state for 'Oklahoma Paranormal Investigations', recording a known issue with PIN authentication getting stuck and a fix request to implement purely client-side PIN validation against the hardcoded PIN '022025' with immediate redirect on success."
}