{
  "backend/analytics.mo": "Defines an Analytics module with mutable maps for tracking page visit counts and form submission counts, providing functions to record events and retrieve aggregated data.",
  "backend/main.mo": "Main actor for the backend that manages CRUD operations for Investigations, Testimonials, and Team Members with admin-only access control, plus analytics tracking and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin login page, admin dashboard, and analytics instrumentation) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing the purpose and key characteristics of each component, page, hook, and config file.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point that mounts the React app into a root div and loads the main TypeScript module, with a title referencing Oklahoma Paranormal Investigations.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, Resources, Team, SubmitCase, AdminLogin, and AdminDashboard, wrapped in ThemeProvider, QueryClientProvider, and AdminProvider.",
  "frontend/src/components/admin/AnalyticsPanel.tsx": "Displays admin analytics dashboard with summary cards for total page visits and form submissions, plus a sorted breakdown of visits per page using data from the `useAnalyticsData` hook.",
  "frontend/src/components/admin/InvestigationsManager.tsx": "Admin CRUD UI for managing investigations, allowing creation, editing, and deletion of investigation records with fields for title, description, date, location, and status via blockchain-backed mutations.",
  "frontend/src/components/admin/TeamManager.tsx": "Admin CRUD UI for managing team members, supporting add, edit, and delete operations for name, role, and bio fields backed by blockchain mutations.",
  "frontend/src/components/admin/TestimonialsManager.tsx": "Admin CRUD UI for managing testimonials with author, quote, and date fields, using blockchain-backed create, update, and delete mutations.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing a sticky header with logo, desktop and mobile navigation links, a theme toggle button, an admin dashboard link shown only to authenticated admins, and an Outlet for child routes.",
  "frontend/src/contexts/AdminContext.tsx": "Provides a React context for admin session state, persisting login status and email to sessionStorage and exposing login/logout callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor instance using React Query, initializing it with the user's Internet Identity or anonymously, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Thin re-export hook that returns the admin context from `AdminContext`.",
  "frontend/src/hooks/useAdminQueries.ts": "Provides React Query hooks for CRUD operations on investigations, testimonials, and team members, each delegating to the backend actor and invalidating the relevant query cache on success.",
  "frontend/src/hooks/useAnalytics.ts": "Custom React hook that provides fire-and-forget analytics tracking functions (`trackPageVisit`, `trackFormSubmission`) by calling the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching public data (investigations, team members) from the backend actor, and re-exports all admin queries.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/component/utility layers, OKLCH-based CSS custom properties for light/dark paranormal themes, and custom utility classes like glow effects and gradient helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/AdminDashboard.tsx": "Protected admin dashboard page with tabbed navigation for managing investigations, testimonials, team members, and analytics; redirects unauthenticated users to the admin login page.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page that validates a hardcoded owner email, optionally verifies admin privileges via the backend actor, and redirects to the dashboard on success.",
  "frontend/src/pages/CaseDetail.tsx": "Empty file with no content; likely a placeholder for a case detail page.",
  "frontend/src/pages/CaseGallery.tsx": "Empty file with no content; likely a placeholder for a case gallery page.",
  "frontend/src/pages/Home.tsx": "Public home page for Oklahoma Paranormal Investigations featuring a hero section, services grid, feature highlights, and stats, with page-visit analytics tracking on mount.",
  "frontend/src/pages/Resources.tsx": "A resources page displaying paranormal phenomena types, investigation equipment, and safety guidelines using tabbed cards with icons and analytics page tracking.",
  "frontend/src/pages/SubmitCase.tsx": "A form page allowing users to submit paranormal case reports with fields for location, phenomena type, description, contact info, and optional photo upload, with simulated submission and analytics tracking.",
  "frontend/src/pages/Team.tsx": "A team page displaying hardcoded investigator profiles with images, bios, roles, and specialties in a responsive card grid, with analytics page tracking.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors (ethereal, spectral, phantom, midnight), glow box shadows, display fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state for a paranormal investigation site, including existing features (admin login, dashboard, analytics instrumentation) and pending feature requests for backend data store, authentication, content management, and analytics monitoring."
}