{
  "backend/analytics.mo": "Defines an Analytics module with mutable maps for tracking page visit counts and form submission counts, plus functions to record and retrieve aggregated stats.",
  "backend/main.mo": "Main ICP actor that manages investigations, cases, testimonials, team members, and user profiles, with admin initialization via Internet Identity, access control mixins, and blob storage support.",
  "backend/migration.mo": "Defines a migration function that transforms the old actor state into a new state shape by adding a null `adminPrincipal` field.",
  "feature_evidence.json": "Feature evidence report documenting that the frontend CasesManager and useCaseQueries hooks were updated to call the backend admin-init endpoint on first authenticated load, with graceful error handling.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing their roles in the application.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, cards, charts, and sidebar.",
  "frontend/index.html": "HTML entry point that sets the page title to 'Oklahoma Paranormal Investigations - Spectral Investigations' and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in QueryClientProvider and AdminProvider, and includes a PostLoginRedirect component for handling post-authentication state.",
  "frontend/src/components/admin/AnalyticsPanel.tsx": "Displays admin analytics including total page visits and form submissions as summary cards, plus a breakdown bar chart of visits per page, fetched via `useAnalyticsData`.",
  "frontend/src/components/admin/CasesManager.tsx": "Admin panel for managing paranormal case submissions, supporting viewing, marking as resolved, deleting cases, and exporting all cases to a CSV file.",
  "frontend/src/components/admin/InvestigationsManager.tsx": "Admin CRUD interface for managing investigation records, allowing admins to create, edit, and delete investigations with fields for title, description, date, location, and status.",
  "frontend/src/components/admin/TeamManager.tsx": "Admin CRUD interface for managing team members, allowing admins to create, edit, and delete entries with name, role, and bio fields.",
  "frontend/src/components/admin/TestimonialsManager.tsx": "React admin component for managing testimonials with create, edit, and delete functionality using form state and mutation hooks.",
  "frontend/src/components/Layout.tsx": "Full-page layout component with a sticky header containing the OKPI logo, desktop and mobile navigation links, a theme toggle, and a login button, plus a footer.",
  "frontend/src/components/LoginButton.tsx": "Reusable button component that handles Internet Identity login and logout, showing loading, authenticated, and unauthenticated states with appropriate icons.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and email to complete their profile setup, submitting the data via the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that restricts access based on admin role, supporting both PIN-based (AdminContext/sessionStorage) and Internet Identity authentication methods, showing appropriate loading or access-denied states.",
  "frontend/src/contexts/AdminContext.tsx": "React context providing PIN-based admin authentication state (isAdmin, adminEmail, login, logout) persisted to both sessionStorage and localStorage.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control with an admin token if present.",
  "frontend/src/hooks/useAdmin.ts": "Thin convenience hook that re-exports the AdminContext consumer for PIN-based admin authentication.",
  "frontend/src/hooks/useAdminQueries.ts": "Collection of React Query hooks for CRUD operations on investigations, testimonials, and team members via the ICP backend actor.",
  "frontend/src/hooks/useAnalytics.ts": "Hook exposing trackPageVisit and trackFormSubmission callbacks that delegate to local analytics recording functions.",
  "frontend/src/hooks/useCaseQueries.ts": "React Query hooks for case management operations including fetching all cases, user-specific cases, marking cases resolved, and deleting cases, with admin initialization logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider implementing Internet Identity authentication via DFINITY's AuthClient, exposing identity state, login/logout functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching/mutating user profiles, cases, and case status, all backed by the ICP actor. Includes hooks for getting caller profile, saving profile, listing cases, submitting new cases, and marking cases resolved.",
  "frontend/src/hooks/useUserRole.ts": "Exposes a React Query hook that fetches the caller's UserRole from the actor and returns convenience booleans (isAdmin, isUser, isGuest) derived from the result.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind base/components/utilities, defines light and dark mode CSS custom properties for a paranormal theme (ethereal, spectral, phantom colors), and adds utility classes for glow text, gradient, and display fonts.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminCases.tsx": "Admin-only page that lists all submitted paranormal cases with options to view details, mark resolved, delete, and export to CSV, protected by ProtectedRoute requiring admin role.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with a tabbed layout (Cases, Investigations, Testimonials, Analytics) protected by ProtectedRoute, featuring a sticky header with logout and navigation to the cases page.",
  "frontend/src/pages/AdminLogin.tsx": "Login page for admin access that collects email and PIN, verifies credentials via the actor's verifyAdminCredentials method, and redirects to the admin cases page on success.",
  "frontend/src/pages/CaseDetail.tsx": "Placeholder case detail page that shows a login prompt for unauthenticated users and a minimal layout with stub content for authenticated users.",
  "frontend/src/pages/CaseFiles.tsx": "Admin-only page that renders the CasesManager component within a protected route, featuring a sticky header with navigation links to dashboard/cases and a logout button.",
  "frontend/src/pages/CaseGallery.tsx": "Public page that requires Internet Identity authentication to view; shows a login prompt if unauthenticated, otherwise renders a placeholder case gallery layout.",
  "frontend/src/pages/Home.tsx": "Landing page for an Oklahoma paranormal investigation service, displaying a hero section, service cards, feature highlights, and stats with analytics page tracking.",
  "frontend/src/pages/MyCase.tsx": "Authenticated user page that fetches and displays the user's submitted paranormal case files by email, handling loading, unauthenticated, and no-profile states.",
  "frontend/src/pages/Resources.tsx": "Informational page presenting paranormal phenomena types, investigation equipment, and related guidance using tabbed cards, with analytics page tracking on mount.",
  "frontend/src/pages/SubmitCase.tsx": "Form page allowing users to submit a paranormal case report with location, phenomena type, description, contact info, and an optional photo upload to the backend actor.",
  "frontend/src/pages/SupernaturalPinLogin.tsx": "A PIN-based admin login page that validates a hardcoded PIN ('022025'), calls the AdminContext login function on success, and navigates to the admin dashboard. Shows error messages after failed attempts and toggles PIN visibility.",
  "frontend/src/pages/Team.tsx": "An empty Team page component with no content or exports defined.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors (including ethereal, midnight, spectral, phantom), custom shadows with glow effects, display/heading font families, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file describing a case management app on the Internet Computer blockchain, listing existing features, known issues, and two pending architectural requests to fix admin principal assignment and case-listing permissions."
}