{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin permissions: auto-assign first logged-in user as admin and fix case loading",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update the frontend CasesManager and related hooks to call the backend admin-init capability on first load when the user is authenticated, ensuring admin status is registered before cases are fetched",
      "acceptanceCriteria": [
        "On first admin login, the frontend triggers the admin-init call before fetching cases.",
        "Cases load and display successfully in the Case Management panel after the init call.",
        "The 'Failed to load cases' error banner no longer appears for the assigned admin.",
        "Subsequent logins by the same admin load cases without re-triggering the init call unnecessarily."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCaseQueries.ts",
          "operation": "modify",
          "description": "Add a new query hook `useInitAdmin` that calls the backend `initAdmin()` capability. This hook should be enabled only when the user is authenticated and the actor is available. The hook will return whether initialization succeeded, allowing components to wait for admin initialization before fetching cases."
        },
        {
          "path": "frontend/src/components/admin/CasesManager.tsx",
          "operation": "modify",
          "description": "Update the CasesManager component to call `useInitAdmin()` on mount when the user is authenticated. Ensure the `useGetAllCases` query is only enabled after the init call completes (or if the user is already initialized). Update error handling to distinguish between initialization failures and permission errors. Remove the 'Failed to load cases' error banner for users who have successfully initialized as admin."
        },
        {
          "path": "frontend/src/pages/AdminCases.tsx",
          "operation": "modify",
          "description": "Ensure the AdminCases page properly handles the initialization flow by coordinating the useInitAdmin and useGetAllCases hooks. Add loading state handling for the initialization phase. If initialization is in progress, show a loading indicator before attempting to load cases."
        }
      ]
    }
  ]
}