{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Case management app on the Internet Computer blockchain with an admin panel for viewing submitted cases. Currently fixing admin permissions so the first logged-in user is auto-assigned as admin and the admin panel loads cases correctly.",
  "architectural_notes": [
    "Deployed on Internet Computer blockchain (ICP); cases stored on-chain and available near-instantly after submission",
    "Admin panel uses principal-based permissions; first logged-in user is auto-assigned admin"
  ],
  "known_issues": [],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-update-the-frontend-casesmanager-and-related-hooks-usecasequeries-ts-to-call-the-backend-admin-init-endpoint-on-first-load-when-the-user-is-authenticated-so-admin-status-is-registered-before-cases-are-fetched-handle-the-case-where-the-init-call-fails-gracefully-without-blocking-the-cases-fetch-for-an-already-registered-admin",
      "title": "Update the frontend `CasesManager` and related hooks (`useCaseQueries.ts`) to call the backend admin-init endpoint on first load (when the user is authenticated) so admin status is registered before cases are fetched. Handle the case where the init call fails gracefully without blocking the cases fetch for an already-registered admin.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update the backend to automatically grant admin privileges to the first principal that calls any admin-gated function or a new `initAdmin` update method, if no admin has been registered yet. Store the admin principal in stable state so it persists across upgrades.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update the backend `getAllCases` (or equivalent admin case-listing) method so it verifies the caller against the stored admin principal and returns all cases without error. Remove or relax any permission check that currently causes the 'Failed to load cases' error for a legitimately assigned admin.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Case Management",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}