{
  "backend/main.mo": "Main backend actor defining ParanormalCase types (with phenomena types, investigation statuses) and functions to submit, retrieve, filter, and update paranormal investigation cases with blob storage support.",
  "feature_evidence.json": "Feature evidence report documenting three features to remove Team-related functionality: removing the '/team' route from App.tsx, removing Team navigation link from Layout.tsx, and deleting the Team.tsx file.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing a paranormal investigation app with routing, case submission/gallery, team page, resources, and dark theme styling.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining light and dark theme CSS variables for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the Paranormal Investigator app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, submit-case, cases gallery, case detail, and resources, wrapped in ThemeProvider with dark theme and Toaster.",
  "frontend/src/components/Layout.tsx": "Layout component with sticky header containing logo, responsive navigation (Home, Case Gallery, Report Activity, Resources), mobile menu toggle, main content outlet, and footer with team info and links.",
  "frontend/src/hooks/useActor.ts": "React Query hook to create and manage backend actor instances based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication providing login, logout, identity state management, and authentication status tracking with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating paranormal case data, including queries for all cases, filtered cases by type/location, individual cases, and mutations for submitting cases and updating case status.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using a paranormal-inspired color palette (purples, greens) and utility classes for glowing text effects and display fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CaseDetail.tsx": "Displays detailed information for a single paranormal case including location, phenomena type, status, description, contact info, and photo with loading and error states.",
  "frontend/src/pages/CaseGallery.tsx": "Renders a filterable gallery of paranormal cases with filters for phenomena type and location, displaying case cards with status badges and navigation to detail pages.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with background image, service cards for different phenomena types (apparitions, sounds, moving objects, EMF anomalies), and feature highlights for the investigation service.",
  "frontend/src/pages/Resources.tsx": "Educational resource page documenting paranormal phenomena types, investigation equipment descriptions and usage, and documentation best practices using tabbed interface and card layouts.",
  "frontend/src/pages/SubmitCase.tsx": "React component for submitting paranormal case reports with form fields for location, phenomena type, description, contact info, and optional photo upload with progress tracking.",
  "frontend/src/pages/Team.tsx": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (dark theme with ethereal/midnight colors), typography, animations, and design tokens for the paranormal investigation website.",
  "project_state.json": "Project state tracking document listing implemented features for a paranormal investigation website including home page, case submission, case gallery, resources page, and visual design with dark atmospheric theme."
}