{
  "backend/main.mo": "Main actor defining ParanormalCase data types (phenomena types, investigation statuses) and functions for submitting, retrieving, filtering, and updating paranormal investigation cases with blob storage support.",
  "feature_evidence.json": "Feature evidence report documenting the footer text update in Layout.tsx to change 'Serving Oklahoma Since 2025' to 'Founded in Oklahoma, 2025' with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files emphasizing Oklahoma-specific branding, paranormal investigation features, and dark theme styling throughout the application.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with paranormal-themed color palette.",
  "frontend/index.html": "HTML entry point with title 'Oklahoma Paranormal Investigations - Spectral Investigations' and root div for React mounting.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, submit case, case gallery, case detail, and resources pages, wrapped with ThemeProvider and Toaster.",
  "frontend/src/components/Layout.tsx": "Layout component with sticky header featuring Spectral Investigations logo and 'Oklahoma's Paranormal Investigators' tagline, responsive navigation, and footer displaying 'Founded in Oklahoma, 2025'.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing backend actor creation with Internet Identity authentication, handling anonymous and authenticated actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication providing login, logout, identity state management, and authentication status tracking with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating paranormal case data, including queries for all cases, filtering by type/location, getting case by ID, and mutations for submitting cases and updating case status.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using a paranormal-inspired color palette (purples, greens, deep blues) and utility classes for glowing text effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CaseDetail.tsx": "Displays detailed information for a single paranormal case including location, phenomena type, status, description, contact info, and photo with loading and error states.",
  "frontend/src/pages/CaseGallery.tsx": "Displays a filterable gallery of paranormal cases from Oklahoma with filters for phenomena type and location, showing case cards with status badges and metadata.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with background image, service cards for different paranormal phenomena types, and feature highlights for the Oklahoma-based investigation service.",
  "frontend/src/pages/Resources.tsx": "Educational resource page documenting paranormal phenomena types, investigation equipment descriptions and usage, and documentation best practices using tabbed interface.",
  "frontend/src/pages/SubmitCase.tsx": "Case submission form page for reporting Oklahoma paranormal activity with fields for location, phenomena type, description, contact info, and optional photo upload with progress tracking.",
  "frontend/src/pages/Team.tsx": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme (ethereal, midnight themes), typography, animations, and design tokens for the paranormal investigation site's dark atmospheric aesthetic.",
  "project_state.json": "Project state tracking document listing implemented features for an Oklahoma-only paranormal investigation website founded in 2025, including home page, case submission, gallery, resources, and themed visual design."
}