{
  "backend/main.mo": "Main backend actor defining ParanormalCase data types (with phenomena types, investigation statuses, and optional photo storage) and providing functions to submit, retrieve, filter, and update paranormal investigation cases stored in a List.",
  "feature_evidence.json": "Feature evidence report documenting implementation of five main features: home page, case submission form, case gallery with filtering, investigation resources page, and dark paranormal-themed visual design with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles in the paranormal investigation application, including routing, layout, pages, hooks, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with paranormal-appropriate color schemes (deep purples, midnight blues, ethereal greens) and component styling tokens.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'Paranormal Investigator', and script reference to main.tsx module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with five routes (home, submit case, case gallery, case detail, resources), wrapping the app with ThemeProvider (dark mode default) and Toaster for notifications.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component with sticky header featuring investigation team logo, responsive navigation menu with mobile hamburger, main content outlet, and footer with team info and quick links.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook managing backend actor creation with Internet Identity authentication, automatically invalidating and refetching dependent queries when identity or actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating paranormal case data, including queries for all cases, filtering by type/location, getting case by ID, and mutations for submitting cases and updating status.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a paranormal-themed color palette for light and dark modes, plus utility classes for glowing text effects and display fonts.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped in QueryClientProvider and InternetIdentityProvider for React Query and ICP authentication.",
  "frontend/src/pages/CaseDetail.tsx": "Case detail page component that displays full information about a single paranormal case including phenomena type, status, location, timestamp, description, contact info, and photo with loading and error states.",
  "frontend/src/pages/CaseGallery.tsx": "Case gallery page with filtering capabilities by phenomena type and location, displaying a grid of case cards with navigation to individual case details.",
  "frontend/src/pages/Home.tsx": "Landing page featuring a hero section with background image, service cards for different paranormal phenomena types, and feature highlights for the investigation service.",
  "frontend/src/pages/Resources.tsx": "Resources page displaying paranormal investigation information including phenomena types (apparitions, sounds, moving objects, EMF anomalies), equipment descriptions (EMF meter, voice recorder, thermal camera, etc.), and documentation guidelines organized in tabs.",
  "frontend/src/pages/SubmitCase.tsx": "Case submission form page allowing users to report paranormal activity with fields for location, phenomena type, description, contact info, and optional photo upload with preview and progress tracking.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH colors (ethereal, midnight themes), extended utilities for shadows/animations, and typography/container query plugins for the paranormal investigation site design.",
  "project_state.json": "Project state tracking file documenting completed features (home page, case submission, gallery, resources) and pending backend requirements for the paranormal investigation website application."
}